[
    {
        "title": "python",
        "description": "Some of my favorite Python features are [list/dict/set] comprehensions and generator expressions for their elegance. I also really love that well-written, clean code is a priority for the language."
    },
    {
        "title": "pytest",
        "description": "I love Pytest's functional approach, the clear test results formatting, and its fixtures."
    },
    {
        "title": "flask",
        "description": "What's not to love? You can get a Flask API up and running fairly quickly and writing view functions feels pretty intuitive for me."
    },
    {
        "title": "html",
        "description": "Fun fact - I started messing around with HTML when I got a tumblr in high school! I love how accessibility is a big part of HTML and it's been fun learning about head tags for search engine optimization (SEO)."
    },
    {
        "title": "css",
        "description": "As an artist, I really appreciate nice visuals and good design, so I always have fun styling a website with CSS. I have especially enjoyed messing around with animations and transitions as I have been working on this portfolio site."
    },
    {
        "title": "javascript",
        "description": "I have a love/hate relationship with JavaScript, but I never get tired of event listeners. There is something very satisfying about triggering and handling events."
    },
    {
        "title": "react",
        "description": "I really love React! Working with component-based elements makes the development process so nice!"
    },
    {
        "title": "sqlalchemy",
        "description": "While the documentation for SQLAlchemy is a bit of a pain, it is really nice handing off database queries to an object relational mapper (ORM)."
    },
    {
        "title": "sql",
        "description": "I find it fascinating how simple the syntax is for SQL and yet it is so powerful as a language. My favorite functionality is probably joins."
    },
    {
        "title": "postgresql",
        "description": "PostgreSQL is great and I love that it's open source."
    },
    {
        "title": "ansible",
        "description": "I am really impressed with how easy it is to do things like navigate around an operating system, check file permissions, and automate the execution of scripts with Ansible."
    },
    {
        "title": "jenkins",
        "description": "I really enjoy creating continuous integration/continuous deployment (CI/CD) pipelines with Jenkins. It's nice seeing all of the aggregated data in one place and I also enjoy the built in secrets management."
    },
    {
        "title": "docker",
        "description": "What's not to love about Docker? Being able to reproduce an environment with lightweight Docker Containers is great for so many reasons, but especially deployments."
    },
    {
        "title": "git",
        "description": "I have used git professionally with GitHub and GitLab. It's just an all around great tool."
    },
    {
        "title": "c++",
        "description": "While C++ is by no means a language I choose to develop with often, I do appreciate the more granular levels of control it gives developers due to it being statically typed and things like its manual memory management."
    },
    {
        "title": "java",
        "description": "Java is another language  I have not used too much, but I enjoy that its statically typed and I recognize its power. So, I would be happy to spend some more time working with Java in the future."
    },
    {
        "title": "render",
        "description": "Render's free tier is pretty solid. It has some bugs, but overall I think it's a decent service."
    },
    {
        "title": "heroku",
        "description": "I really enjoyed deployments with Heroku, but I'm sad they got rid of their free tier."
    },
    {
        "title": "robot framework",
        "description": "This testing framework is super unique and I'm intrigued by their plain English approach to tests. It was fun working with this one!"
    }
]
